package Ch08;

public class C00Class {

	public static void main(String[] args) {
		/*
		선언 : 강제력이 없다(메모리 공간을 차지하지않는다)
		정의 : 강제력이 있다(메모리공간을 차지)
		객체의 사전적 정의 : 현실세계의 존재 사물
		존재 : 배타적이고 독점적인 공간을 차지한다
		
		1 클래스 : 동일 유형의 객체를 만들기 위해서 미리 선언되어진 자료형
			    클래스마다 요구되는 메모리공간이 다르기때문 기존의 메모리영역이 아닌
			    객체만의 메모리 영역이 필요하다
			    디자인된 클래스마다 필요한 메모리공간은 다를 수있다
	    2 객체 : 클래스 자료형으로 정의된(메모리 공간을 차지)상태의 데이터의 집합
	    
	
	    3 JAVA 의 JVM 이 사용하는 메모리 영역
	    
	    	1 스택영역		: 기본자료형에 의한 공간
	    	2 클래스영역	: 공유영역 공간
	    	3 힙영역 		: 객체 저장 영역
	    	
	    	
	    Scanner sc = new Scanner()
	    
	    Scanner : 클래스 자료형
	    sc 		: 참조변수
	    new 	: 힙영역을 사용
	    Scanner() : 생성자메서드(객체에 필요한 공간형성 + 초기값 대입)
	    */
	    
	    

	}

}
